// Copyright (c) 2011 The Chromium OS Authors. All rights reserved.
// Use of this source code is governed by a BSD-style license that can be
// found in the LICENSE file.

/* Menus */
"Menu About" = "Informazioni su Chrome OS Image Creator";
"Menu Prefs" = "Preferenze…";
"Menu Services" = "Servizi";
"Menu Hide" = "Nascondi Chrome OS Image Creator";
"Menu Hide Others" = "Nascondi altri";
"Menu Show All" = "Mostra tutto";
"Menu Quit" = "Esci da Chrome OS Image Creator";
"Menu Window" = "Finestra";
"Menu Minimize" = "Riduci a icona";
"Menu Zoom" = "Zoom";
"Menu Bring All To Front" = "Porta tutto in primo piano ";
"Menu Help" = "Guida";
"Menu App Help" = "Guida di Chrome OS Image Creator";

/* Buttons */
"Button Previous" = "Indietro";
"Button Next" = "Avanti";
"Button Stop" = "Interrompi";
"Button Done" = "Fine";

/* Tab: Select device model */
"Text Welcome" = "Questo strumento consente di creare una scheda SD o una chiavetta USB di ripristino, in modo da ripristinare il dispositivo Chrome OS.\n\nInserisci il numero di modello del dispositivo Chrome OS (ad esempio, SAMS ALEX BETA-US 8738). Viene visualizzato nella parte inferiore della schermata che ti chiede di collegare un dispositivo per il ripristino.";
"Text Model" = "Modello:";
"Button Local Image" = "Immagine locale…";

/* Tab: Select USB stick */
"Text Select Prompt" = "Seleziona un dispositivo di archiviazione rimovibile da utilizzare per il ripristino:";
"Text Insertion Prompt" = "Inserisci una scheda SD o una chiavetta USB.";

/* Tab: Done */
"Text Congrats" = "Il supporto è pronto. Ora puoi rimuoverlo dal sistema e utilizzarlo per ripristinare il dispositivo Chrome OS.";

/* Sizes */
"Size Bytes" = " byte";
"Size Kilobytes" = " kB";
"Size Megabytes" = " MB";
"Size Gigabytes" = " GB";
"Size Terabytes" = " TB";
"Size Petabytes" = " PB";

/* Error starting Disk Arbitration. */
"NoDiskArb Message" = "Impossibile eseguire questa applicazione.";
"NoDiskArb Informative" = "Si è verificato un problema durante l'avvio dell'arbitraggio del disco. Questo non dovrebbe accadere.";
"NoDiskArb OK" = "OK";

/* Error retrieving config file. */
"CantGetConfig Message" = "Impossibile recuperare l'elenco di immagini.";
"CantGetConfig Informative" = "Si è verificato un problema durante il recupero dell'elenco di immagini di ripristino disponibili (%1$@). Verifica che la connessione di rete funzioni.";
"CantGetConfig OK" = "OK";
"CantGetConfig Error NoConnection" = "Impossibile allocare una connessione";
"CantGetConfig Error DownloadError" = "Si è verificato un errore durante il download";
"CantGetConfig Error StringCreate" = "Impossibile utilizzare la risposta";

/* Version error. */
"VersionError Message" = "Questa versione dell'applicazione è troppo vecchia.";
"VersionError Informative" = "Scarica una versione più recente. Questa versione è %1$@; occorre almeno la versione %2$@. %3$@";
"VersionError OK" = "Scarica nuova versione";

/* File dialog to select a local file. */
"SelectLocal File" = "Seleziona un'immagine:";
"SelectLocal Button" = "Seleziona";

/* Alert on writing stick. */
"WriteAlert Message" = "Cancellare definitivamente i dati di %1$@?";
"WriteAlert Informative" = "Tutti i dati attualmente memorizzati sul dispositivo verranno persi definitivamente. Non è possibile annullare questa azione.";
"WriteAlert Cancel" = "Non cancellare";
"WriteAlert OK" = "Cancella";

"TooSmallAlert Message" = "Impossibile utilizzare %1$@; capacità insufficiente.";
"TooSmallAlert Informative" = "È richiesta una scheda SD o una chiavetta USB da almeno %2$@.";
"TooSmallAlert OK" = "OK";

"NotWritable Message" = "Impossibile utilizzare %1$@; è di sola lettura.";
"NotWritable Informative" = "La scheda SD o la chiavetta USB è di sola lettura. Potrebbe esserci un'opzione per passare dalla modalità di sola lettura a quella di scrittura; in caso contrario, non potrai utilizzarla.";
"NotWritable OK" = "OK";

"Label SD Card" = "Scheda SD";

/* Stick writing statuses. */
"Status Downloading" = "Download in corso…";
"Status Verifying Image" = "Verifica dell'immagine di ripristino in corso…";
"Status Unpacking" = "Decompressione in corso…";
"Status Claiming" = "Richiesta in corso…";
"Status Unmounting" = "Smontaggio in corso…";
"Status Writing" = "Scrittura in corso…";
"Status Verifying Media" = "Verifica del supporto di ripristino in corso…";
"Status Ejecting" = "Espulsione in corso…";
"Status Done" = "Operazione completata.";

"StatusAdd Attempt" = " (tentativo %1$d)";

/* Errors */
"Failure Downloading" = "Spiacenti, si è verificato un errore (impossibile scaricare l'immagine di origine). Riprovare?";
"Failure Verifying Return Value" = "Spiacenti, si è verificato un errore (impossibile verificare l'immagine di origine, errore del programma, %1$s). Riprovare?";
"Failure Verifying SHA Mismatch" = "Spiacenti, si è verificato un errore (impossibile verificare l'immagine di origine, errore di checksum). Riprovare?";
"Failure Unpacking" = "Spiacenti, si è verificato un errore (impossibile decomprimere l'immagine di origine, %1$s). Riprovare?";
"Failure Claiming" = "Spiacenti, si è verificato un errore (impossibile richiedere la chiavetta USB). Riprovare?";
"Failure Unmounting" = "Spiacenti, si è verificato un errore (impossibile smontare la chiavetta USB). Riprovare?";
"Failure Opening Source Image" = "Spiacenti, si è verificato un errore (impossibile aprire l'immagine di origine, %1$s). Riprovare?";
"Failure Opening Destination Device" = "Spiacenti, si è verificato un errore (impossibile aprire la chiavetta USB, %1$s). Riprovare?";
"Failure Reading Source Image" = "Spiacenti, si è verificato un errore (impossibile leggere dall'immagine di origine, %1$s). Riprovare?";
"Failure Writing Destination Device" = "Spiacenti, si è verificato un errore (impossibile scrivere dati sulla chiavetta USB, %1$s). Riprovare?";
"Failure Reading Destination Device" = "Spiacenti. Si è verificato un errore (lettura della chiavetta USB non riuscita, %1$s). Vuoi riprovare?";
"Failure Resetting Source Image" = "Spiacenti. Si è verificato un errore (ripristino dell'immagine sorgente non riuscito, %1$s). Vuoi riprovare?";
"Failure Resetting Destination Device" = "Spiacenti. Si è verificato un errore (ripristino della chiavetta USB non riuscito, %1$s). Vuoi riprovare?";
"Failure Ejecting" = "Spiacenti, si è verificato un errore (impossibile espellere la chiavetta USB). Riprovare?";

"Failure Try Again" = "Riprova";
"Failure Quit" = "Esci";

"Failure Termination Status" = "Stato chiusura %d";

"Failure Internal Error 1" = "Fine del file (EOF) imprevista";
